# IsSplitSection Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSection..::..IsSplitSection Method
ViewSection Class See Also
---
Sections can be split (jog) so that they cut at >1 plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool IsSplitSection()
```

Visual Basic
---
```text
Public Function IsSplitSection As Boolean
```

Visual C++
---
```text
public:
bool IsSplitSection()
```

# ### Return Value
True if the section is split.
# See Also
ViewSection Class
Autodesk.Revit.DB Namespace